<?php

namespace App\Discord\SlashCommands\Lfg;

class TaggingFrases
{
    public static function get(): array
    {
        return [
            'AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA',
            'Ало!',
            'Лол. 😀',
            'Вставай Бамбас!!!11',
            'А що буде, якщо я натисну на цю кніпку?',
            'Кнопку тегнути всіх натиснуто.',
            'Ходімте у войс, там зараз буде щось цікаве. 👀',
            'Го бамбіть Бімбас!',
            'Ану бігом всі у войс!',
            'Прийом...📟',
            'Підйом!!!11',
            'Сподіваюсь ви там всі вже прокинулись... хоча... не важливо, тегаю усіх учасників.',
            'Хтось ще не зайшов у войс? Тегаю всіх коротше.',
            'Мені не жалько, тегаю всіх. Лол.',
            'У нас тут дуже важлива подія...',
            'Біп буп. 🤖 Робот викликає усіх учасників.',
            'Обережно! Скидаю бімбу!!!11 🚀 ...а йой... то не та кнопка була.',
            'Вас тут так багацько! Терміново натискаю на кнопку тегнути всіх учасників.',
            '3... 2... 1... 🚀',
        ];
    }
}